app/views/tasks/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE ("tasks".list_id = 1)
---

	    <% unless list.tasks.empty? %>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."done" = 'f'
---

		<% unless list.done_tasks.empty? %>

SELECT "lists".* FROM "lists"
---
<% if listid = params[:list] %>
    <% prevlist = List.find listid %>