app/controllers/lists_controller.rb

INSERT INTO "lists" ("created_at", "updated_at", "name") VALUES ('2011-06-08 23:39:26.851702', '2011-06-08 23:39:26.851702', 'inbox')
---
  def create
    @list = List.new(params[:list])

    respond_to do |format|
      if @list.save