app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."done" = 't' AND ("tasks".list_id = 1)
SELECT "lists".* FROM "lists"
SELECT "tasks".* FROM "tasks" WHERE ("tasks".list_id = 1)
---
  def index
    @headers = request.headers.env.reject { |key| key.to_s.include?('.') }
    @todo   = Task.where(:done => false)
    @task   = Task.new
    @lists  = List.all
    @list   = List.new

    respond_to do |format|
      format.html
      format.json do
        render :json => {:tasks => Task.all.map(&:to_json) }

INSERT INTO "tasks" ("updated_at", "created_at", "name", "done", "list_id") VALUES ('2011-06-09 18:32:20.045472', '2011-06-09 18:32:20.045472', 'Do something important', 'f', 1)
---
  def create
    @list = List.find(params[:list_id])
    raw_params = params[:task].is_a?(String) ? JSON.parse(params[:task]) : params[:task]
    task_params = ActionController::Parameters.new(raw_params)
    @task = @list.tasks.new(task_params.permit(:name))
    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 2 LIMIT 1
UPDATE "tasks" SET "updated_at" = '2011-06-08 23:18:01.004755', "done" = 't' WHERE "tasks"."id" = 8
---
  def update
    @list = List.find(params[:list_id])
    @task = @list.tasks.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(task_attributes)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
DELETE FROM "tasks" WHERE "tasks"."id" = 1
---
  def destroy
    @list = List.find(params[:list_id])
    @task = Task.find(params[:id])
    @task.destroy